app/controllers/home_controller.rb

SELECT "users".* FROM "users"
---
  def index
  	if signed_in?
    	@users = User.all